function getvalve() {
  var text1 = document.getElementById('name');
 var value = text1.value

 if (value !== ""){
  let btn = document.getElementById("btn");
let output = document.getElementById("random");
let text = [value + " " + "ඔබ කෙනෙකුට විශ්වාස කළ හැකි කෙනෙකි. ඔබේ අවංකභාවය සහ විශ්වාසය නිසා, ඔබ මිනිසුන් අතර ගෞරවනීය සහ ආදරණීය වේ. ඔබේ පසුබැසීම සහ විශ්වාසදායක කම නිසා, සෑම කෙනෙකුටම ඔබ සමඟ කටයුතු කිරීමෙන් සතුටු වීමට හැකිය.",value + " " + "ඔබ සාමකාමී සහ සෙනෙහසින් පිරී ඇත. ඔබ අනෙකුන්ට පිළිසරන භාවයෙන් හා ආදරයෙන් හැසිරේ. ඔබේ සාමකාමී ස්වභාවය සහ සෙනෙහස අනෙකුන්ගේ හදවත දිනා ගන්නා අතර, ඔබ සමඟ කටයුතු කිරීමෙන් සෑම විටම කෙනෙකුට සතුටු වීමට හැකිය.",value + " " + "ඔබ උත්සාහයෙන් සහ අධිෂ්ඨානයෙන් පිරී ඇත. ඔබ කිසිදු කාර්යයක් අසාර්ථකව ඉතිරි නොකරන අතර, නිතරම ඉලක්ක කරගෙන එය සාක්ෂාත් කර ගන්නා බව පෙන්වයි. ඔබේ අධිෂ්ඨානය සහ කාර්යශීලීත්වය ඔබව නිරතුරුවම සාර්ථකත්වයට පත් කරයි",value + " " + "ඔබ අනුකම්පාවෙන් සහ උදාරභාවයෙන් පිරී ඇත. ඔබ නිතරම අනෙක් අයට උපකාර කිරීමෙන් හා සෙනෙහසින් පිරුණු ක්‍රියාවන් සිදු කිරීමෙන් සතුටු වෙයි. ඔබේ අනුකම්පාව සහ උදාරභාවය ඔබව අන් අයට ආදරණීය හා ගෞරවනීය කරයි.",value + " " + "ඔබ නිහතමානී සහ විනීත කෙනෙකි. ඔබේ නිහතමානීත්වය සහ උදව්වට කැමති කම නිසා, සෑම කෙනෙකුටම ඔබ සමඟ කටයුතු කිරීමේදී සතුටු වීමට හැකිය. ඔබේ විනීතභාවය සහ උදව්වෙන් පිරුණු හැසිරීම ඔබව ආදරණීය සහ ගෞරවනීය කරයි",value + " " + "ඔබ සෑම විටම අභියෝගයන්ට මුහුණ දෙන්නේ මනෝබලයෙන් සහ දික්කසාද නොවීම් බවෙන් ය. ඔබ කාර්යයන් කරා දිවෙන විට, ඔබගේ අධිෂ්ඨානය සහ ධෛර්යය නිසා අධිෂ්ඨානයෙන් කටයුතු කරයි. ඔබේ මේ ගුණාංග එදිනෙදා ජීවිතයේ අසීරුකම් ජයගැනීමට මාර්ගයක් වේ.",value + " " + "ඔබ කෙලෙසම අන් අයට උපකාර කිරීමට කැමති කෙනෙකු ලෙස දකින්නෙමු. ඔබේ පරිත්‍යාගිත්වය සහ උදවිය ඔබට ආදරය සහ ගෞරවයක් දිනා ගෙන ඇත. ඔබ නිතරම අනෙකුන්ගේ අවශ්‍යතා ගැන සැලකිලිමත් වන අතර, එමඟින් ඔබගේ පාරිසරිකය ඔස්සේ විශිෂ්ට සම්බන්ධතා නිර්මාණය කරයි.",value + " " + "ඔබට හැකි දේ නිරීක්ෂණය සහ විශ්ලේෂණය කර, මනා තීරණ ගන්නේ පුළුල් පරීක්ෂණයක් මතය. ඔබේ විශ්ලේෂණාත්මක සිතීම සහ ප්‍රබල තීරණ ගැනීමේ හැකියාව ඔබට කාර්යයන් හා සැලසුම් සාර්ථකව නිම කරගත හැකි බවට විශ්වාසයි.",value + " " + "ඔබ කුසලතා සහ පරිසරය සතුටු කරන කෙනෙකි. ඔබ කෙලෙසම පරිසරය සුරකින්නට කැමති අතර, එය ඔබේ විනෝදාංශ සහ පරිසරයට ආදරය කිරීමෙන් පෙනේ. ඔබේ රසාස්වාදය සහ පරිසරය සුරකින ලද කැමැත්ත ඔබට හොඳම සෞඛ්‍යයක් සහ සතුටක් ලබා දෙයි",value + " " + "ඔබ හෙමිහිට කටයුතු කරන අතර, කෙලෙසම අන් අයට උපකාර කිරීමට සදාකාලීනව කැමති කෙනෙකි. ඔබේ උදව්වට කැමැත්ත සහ සෙනෙහස නිසා, ඔබ සමාජයේ විශේෂත්වයක් සහ ගෞරවයක් දිනා ගෙන ඇත. ඔබේ ආදරය සහ කරුණාව, ඔබගේ පරිසරය තුළ සමානතාවයක් සහ සාමයක් ඇති කරයි",];

text1.value = '';

btn.addEventListener("click", function () {
  var randomQuate = text[Math.floor(Math.random() * text.length)];
  output.innerHTML = randomQuate;
});
 }else{
  let Empty = document.getElementById('random');
  Empty.innerHTML = "ඔබ ගැන දැන ගැනිමට පළමුව ඔබගේ නම ඇතුලත් කරන්න.පසුව 'බලන්න' ලෙස සදහන් බොත්තම Double  Press කරන්න.";
 }
 
}

 




/*let btn = document.getElementById("btn");
let output = document.getElementById("random");
let text = [textvaue + "this is sampale", "anthore sampale"];

btn.addEventListener("click", function () {
  var randomQuate = text[Math.floor(Math.random() * text.length)];
  output.innerHTML = randomQuate;
});*/
